app/controllers/employes_controller.rb

SELECT `employes`.* FROM `employes` WHERE (name LIKE '%da%' OR age LIKE '%da%' OR description LIKE '%da%' OR hobby LIKE '%da%')
SELECT `employes`.* FROM `employes` ORDER BY name desc
---
  def index
    @employes = Employe.all
    if params[:search].present?
      puts "Search query: #{params[:search]}"
      # @employes = Employe.where("name LIKE ?", "%#{params[:search]}%")
      @employes = Employe.where("name LIKE ? OR age LIKE ? OR description LIKE ? OR hobby LIKE ?",
                          "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%")

    end

    if params[:sort].present?
      sort_columns = {
        "name" => "name",
        "age" => "age",
        "description" => "description"

      }

      sort_column = sort_columns[params[:sort]] || "name"
      sort_direction = params[:direction] == "desc" ? "desc" : "asc"

      @employes = @employes.order("#{sort_column} #{sort_direction}")

SELECT `employes`.* FROM `employes` WHERE `employes`.`id` = 10 LIMIT 1
---
  def show
    @employe = Employe.find(params[:id])

INSERT INTO `employes` (`name`, `age`, `created_at`, `updated_at`, `salary`, `position`, `gender`, `hobby`, `description`) VALUES ('chetan', '28', '2023-02-17 04:14:18.771797', '2023-02-17 04:14:18.771797', 3435, 'Developer', 'male', '[\"Soccer\", \"Volley Ball\"]', 'here are description\n\nwhere we can something\n')
UPDATE `employes` SET `employes`.`updated_at` = '2023-02-16 08:12:22.971547', `employes`.`salary` = 45664, `employes`.`position` = 'Developer' WHERE `employes`.`id` = 1
---
  def create
    @employe = Employe.create(employe_params)
    @employe.gender = params[:employe][:gender]
    if @employe.save

SELECT `employes`.* FROM `employes` WHERE `employes`.`id` = 16 LIMIT 1
---
  def edit
    @employe = Employe.find(params[:id])

SELECT `employes`.* FROM `employes` WHERE `employes`.`id` = 4 LIMIT 1
UPDATE `employes` SET `employes`.`updated_at` = '2023-02-17 09:20:15.199887', `employes`.`salary` = 3245, `employes`.`position` = 'Manager', `employes`.`gender` = 'male', `employes`.`hobby` = '[\"Soccer\", \"Volley Ball\"]', `employes`.`description` = 'jksdfjkjkffasfjasdjksdafsdf' WHERE `employes`.`id` = 9
---
  def update
    @employe = Employe.find(params[:id])
    @employe.gender = params[:employe][:gender]
    if @employe.update(employe_params)

SELECT `employes`.* FROM `employes` WHERE `employes`.`id` = 12 LIMIT 1
DELETE FROM `employes` WHERE `employes`.`id` = 3
---
  def destroy
    @employe = Employe.find(params[:id])
    @employe.destroy